In [1]:
# importando bibliotecas

import pandas as pd
import sqlite3

In [ ]:
# instalando o kernel SQL ipython-sql
!pip install ipython-sql

In [3]:
cnn = sqlite3.connect("TP1.db")

In [2]:
%load_ext sql

In [4]:
%reload_ext sql

In [6]:
%sql sqlite:///TP1.db

In [7]:
%sql

 * sqlite:///TP1.db

In [9]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [9]:
%%sql

CREATE TABLE filmes (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    titulo TEXT,
    genero TEXT,
    duracao INTEGER,
    classificacao_indicativa INTEGER
);

 * sqlite:///TP1.db
Done.

[]

In [10]:
%%sql

INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Noites Brutais', 'Terror', 102, 18);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Nosferatu', 'Terror', 132, 18);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('O Homem nas Trevas', 'Terror', 88, 18);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Hush: A Morte Ouve', 'Terror', 87, 14);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Longlegs - Vínculo Mortal', 'Terror', 101, 18);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('A Substância', 'Terror', 140, 18);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Entrevista com o Demônio', 'Terror', 99, 18);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Um Lugar Silencioso: Dia Um', 'Terror', 99, 16);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Nós', 'Terror', 121, 18);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Corra', 'Terror', 104, 18);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Duro de Matar', 'Ação', 131, 12);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Velozes e Furiosos', 'Ação', 106, 12);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Gente Grande', 'Comédia', 102, 12);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Até Que a Sorte nos Separa', 'Comédia', 104, 10);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Minha Mãe é Uma Peça', 'Comédia', 85, 12);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('1917', 'Drama', 119, 16);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Titanic', 'Drama', 194, 14);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Ainda Estou Aqui', 'Drama', 135, 16);
INSERT INTO filmes(titulo, genero, duracao, classificacao_indicativa) VALUES ('Vingadores: Ultimato', 'Ação', 181, 12);

 * sqlite:///TP1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%sql SELECT * FROM filmes

 * sqlite:///TP1.db
Done.

[(1, 'Noites Brutais', 'Terror', 102, 18),
 (2, 'Nosferatu', 'Terror', 132, 18),
 (3, 'O Homem nas Trevas', 'Terror', 88, 18),
 (4, 'Hush: A Morte Ouve', 'Terror', 87, 14),
 (5, 'Longlegs - Vínculo Mortal', 'Terror', 101, 18),
 (6, 'A Substância', 'Terror', 140, 18),
 (7, 'Entrevista com o Demônio', 'Terror', 99, 18),
 (8, 'Um Lugar Silencioso: Dia Um', 'Terror', 99, 16),
 (9, 'Nós', 'Terror', 121, 18),
 (10, 'Corra', 'Terror', 104, 18),
 (11, 'Duro de Matar', 'Ação', 131, 12),
 (12, 'Velozes e Furiosos', 'Ação', 106, 12),
 (13, 'Gente Grande', 'Comédia', 102, 12),
 (14, 'Até Que a Sorte nos Separa', 'Comédia', 104, 10),
 (15, 'Minha Mãe é Uma Peça', 'Comédia', 85, 12),
 (16, '1917', 'Drama', 119, 16),
 (17, 'Titanic', 'Drama', 194, 14),
 (18, 'Ainda Estou Aqui', 'Drama', 135, 16),
 (19, 'Vingadores: Ultimato', 'Ação', 181, 12)]

In [12]:
%%sql

CREATE TABLE salas (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nome TEXT,
    capacidade INTEGER
);

 * sqlite:///TP1.db
Done.

[]

In [13]:
%%sql

INSERT INTO salas(nome, capacidade) VALUES ("01", 50);
INSERT INTO salas(nome, capacidade) VALUES ("02", 130);
INSERT INTO salas(nome, capacidade) VALUES ("03", 80);
INSERT INTO salas(nome, capacidade) VALUES ("04", 120);
INSERT INTO salas(nome, capacidade) VALUES ("05", 105);
INSERT INTO salas(nome, capacidade) VALUES ("06", 90);
INSERT INTO salas(nome, capacidade) VALUES ("07", 125);
INSERT INTO salas(nome, capacidade) VALUES ("08", 180);

 * sqlite:///TP1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%sql SELECT * FROM salas

 * sqlite:///TP1.db
Done.

[(1, '01', 50),
 (2, '02', 130),
 (3, '03', 80),
 (4, '04', 120),
 (5, '05', 105),
 (6, '06', 90),
 (7, '07', 125),
 (8, '08', 180)]

In [15]:
%%sql

CREATE TABLE sessoes (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    filmes_id INTEGER,
    salas_id INTEGER,
    data_hora TEXT,
    preco_ingresso REAL,
    FOREIGN KEY (filmes_id) REFERENCES filmes(id),
    FOREIGN KEY (salas_id) REFERENCES salas(id)
);

 * sqlite:///TP1.db
Done.

[]

In [16]:
%%sql

INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (1, 1, "2025-04-23", 12.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (1, 1, "2025-04-23", 12.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (2, 1, "2025-04-23", 35.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (2, 2, "2025-04-23", 35.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (2, 1, "2025-04-23", 29.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (3, 5, "2025-04-23", 42.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (4, 6, "2025-04-23", 10.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (4, 6, "2025-04-23", 10.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (5, 1, "2025-04-23", 15.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (5, 2, "2025-04-23", 15.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (5, 3, "2025-04-23", 15.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (6, 8, "2025-04-24", 25.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (7, 5, "2025-04-24", 13.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (7, 5, "2025-04-24", 13.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (8, 8, "2025-04-24", 52.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (9, 1, "2025-04-24", 39.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (9, 7, "2025-04-24", 39.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (9, 1, "2025-04-24", 34.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (18, 8, "2025-04-24", 52.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (19, 1, "2025-04-25", 24.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (19, 2, "2025-04-25", 24.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (19, 3, "2025-04-25", 24.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (19, 4, "2025-04-25", 24.99);
INSERT INTO sessoes(filmes_id, salas_id, data_hora, preco_ingresso) VALUES (19, 5, "2025-04-25", 24.99);

 * sqlite:///TP1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%sql SELECT * FROM sessoes

 * sqlite:///TP1.db
Done.

[(1, 1, 1, '2025-04-23', 12.99),
 (2, 1, 1, '2025-04-23', 12.99),
 (3, 2, 1, '2025-04-23', 35.99),
 (4, 2, 2, '2025-04-23', 35.99),
 (5, 2, 1, '2025-04-23', 29.99),
 (6, 3, 5, '2025-04-23', 42.99),
 (7, 4, 6, '2025-04-23', 10.99),
 (8, 4, 6, '2025-04-23', 10.99),
 (9, 5, 1, '2025-04-23', 15.99),
 (10, 5, 2, '2025-04-23', 15.99),
 (11, 5, 3, '2025-04-23', 15.99),
 (12, 6, 8, '2025-04-24', 25.99),
 (13, 7, 5, '2025-04-24', 13.99),
 (14, 7, 5, '2025-04-24', 13.99),
 (15, 8, 8, '2025-04-24', 52.99),
 (16, 9, 1, '2025-04-24', 39.99),
 (17, 9, 7, '2025-04-24', 39.99),
 (18, 9, 1, '2025-04-24', 34.99),
 (19, 18, 8, '2025-04-24', 52.99),
 (20, 19, 1, '2025-04-25', 24.99),
 (21, 19, 2, '2025-04-25', 24.99),
 (22, 19, 3, '2025-04-25', 24.99),
 (23, 19, 4, '2025-04-25', 24.99),
 (24, 19, 5, '2025-04-25', 24.99)]

In [18]:
%%sql

CREATE TABLE clientes (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nome TEXT,
    email TEXT,
    data_nascimento TEXT
);

 * sqlite:///TP1.db
Done.

[]

In [19]:
%%sql

INSERT INTO clientes(nome, email, data_nascimento) VALUES ("Marcele Araponga", "louise20marcele03@gmail.com", "2003-09-24");
INSERT INTO clientes(nome, email, data_nascimento) VALUES ("Laísa Toledo", "laisacunha11@gmail.com", "2002-09-09");
INSERT INTO clientes(nome, email, data_nascimento) VALUES ("Flávia Nunes", "flavianunesoli2@gmail.com", "2006-05-07");
INSERT INTO clientes(nome, email, data_nascimento) VALUES ("Maria Clara Barbosa", "clarinhadeitiúba@gmail.com", "2004-02-18");

 * sqlite:///TP1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%sql SELECT * FROM clientes

 * sqlite:///TP1.db
Done.

[(1, 'Marcele Araponga', 'louise20marcele03@gmail.com', '2003-09-24'),
 (2, 'Laísa Toledo', 'laisacunha11@gmail.com', '2002-09-09'),
 (3, 'Flávia Nunes', 'flavianunesoli2@gmail.com', '2006-05-07'),
 (4, 'Maria Clara Barbosa', 'clarinhadeitiúba@gmail.com', '2004-02-18')]

In [21]:
%%sql

CREATE TABLE ingressos (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    sessao_id INTEGER,
    cliente_id INTEGER,
    data_compra TEXT,
    FOREIGN KEY (sessao_id) REFERENCES sessoes(id),
    FOREIGN KEY (cliente_id) REFERENCES clientes(id)
);

 * sqlite:///TP1.db
Done.

[]

In [22]:
%%sql

INSERT INTO ingressos(sessao_id, cliente_id, data_compra) VALUES (18, 3, "2025-04-11");
INSERT INTO ingressos(sessao_id, cliente_id, data_compra) VALUES (19, 3, "2025-04-15");
INSERT INTO ingressos(sessao_id, cliente_id, data_compra) VALUES (5, 3, "2025-04-17");
INSERT INTO ingressos(sessao_id, cliente_id, data_compra) VALUES (19, 2, "2025-04-16");
INSERT INTO ingressos(sessao_id, cliente_id, data_compra) VALUES (1, 1, "2025-04-25");
INSERT INTO ingressos(sessao_id, cliente_id, data_compra) VALUES (2, 1, "2025-04-07");
INSERT INTO ingressos(sessao_id, cliente_id, data_compra) VALUES (18, 1, "2025-04-07");
INSERT INTO ingressos(sessao_id, cliente_id, data_compra) VALUES (1, 3, "2025-04-11");
INSERT INTO ingressos(sessao_id, cliente_id, data_compra) VALUES (2, 3, "2025-04-07");

 * sqlite:///TP1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [23]:
%sql SELECT * FROM ingressos GROUP BY sessao_id

 * sqlite:///TP1.db
Done.

[(5, 1, 1, '2025-04-25'),
 (6, 2, 1, '2025-04-07'),
 (3, 5, 3, '2025-04-17'),
 (1, 18, 3, '2025-04-11'),
 (2, 19, 3, '2025-04-15')]

In [24]:
# A1: Título dos filmes do gênero "Ação"

%sql SELECT titulo FROM filmes WHERE genero="Ação"

 * sqlite:///TP1.db
Done.

[('Duro de Matar',), ('Velozes e Furiosos',), ('Vingadores: Ultimato',)]

In [25]:
# A2: Nome das salas que comportam mais de 100 pessoas

%sql SELECT nome FROM salas WHERE capacidade>100

 * sqlite:///TP1.db
Done.

[('02',), ('04',), ('05',), ('07',), ('08',)]

In [26]:
# A3 Título e preço dos ingressos dos filmes que estão em cartaz

%sql SELECT titulo, preco_ingresso FROM sessoes, filmes WHERE sessoes.filmes_id = filmes.id

 * sqlite:///TP1.db
Done.

[('Noites Brutais', 12.99),
 ('Noites Brutais', 12.99),
 ('Nosferatu', 35.99),
 ('Nosferatu', 35.99),
 ('Nosferatu', 29.99),
 ('O Homem nas Trevas', 42.99),
 ('Hush: A Morte Ouve', 10.99),
 ('Hush: A Morte Ouve', 10.99),
 ('Longlegs - Vínculo Mortal', 15.99),
 ('Longlegs - Vínculo Mortal', 15.99),
 ('Longlegs - Vínculo Mortal', 15.99),
 ('A Substância', 25.99),
 ('Entrevista com o Demônio', 13.99),
 ('Entrevista com o Demônio', 13.99),
 ('Um Lugar Silencioso: Dia Um', 52.99),
 ('Nós', 39.99),
 ('Nós', 39.99),
 ('Nós', 34.99),
 ('Ainda Estou Aqui', 52.99),
 ('Vingadores: Ultimato', 24.99),
 ('Vingadores: Ultimato', 24.99),
 ('Vingadores: Ultimato', 24.99),
 ('Vingadores: Ultimato', 24.99),
 ('Vingadores: Ultimato', 24.99)]

In [27]:
# A4: Nomes dos clientes que compraram algum ingresso (?)

%sql SELECT nome FROM clientes, ingressos WHERE clientes.id=ingressos.cliente_id

 * sqlite:///TP1.db
Done.

[('Flávia Nunes',),
 ('Flávia Nunes',),
 ('Flávia Nunes',),
 ('Laísa Toledo',),
 ('Marcele Araponga',),
 ('Marcele Araponga',),
 ('Marcele Araponga',),
 ('Flávia Nunes',),
 ('Flávia Nunes',)]

In [28]:
# A5: Título dos filmes cuja classificação indicativa é maior que 16 anos

%sql SELECT titulo FROM filmes WHERE classificacao_indicativa>16

 * sqlite:///TP1.db
Done.

[('Noites Brutais',),
 ('Nosferatu',),
 ('O Homem nas Trevas',),
 ('Longlegs - Vínculo Mortal',),
 ('A Substância',),
 ('Entrevista com o Demônio',),
 ('Nós',),
 ('Corra',)]

In [29]:
# A6: Nome dos clientes que compraram ingressps para alguma sessão e a data da compra

%sql SELECT nome, data_compra FROM clientes, ingressos, sessoes WHERE ingressos.sessao_id=sessoes.id AND clientes.id=ingressos.cliente_id

 * sqlite:///TP1.db
Done.

[('Flávia Nunes', '2025-04-11'),
 ('Flávia Nunes', '2025-04-15'),
 ('Flávia Nunes', '2025-04-17'),
 ('Laísa Toledo', '2025-04-16'),
 ('Marcele Araponga', '2025-04-25'),
 ('Marcele Araponga', '2025-04-07'),
 ('Marcele Araponga', '2025-04-07'),
 ('Flávia Nunes', '2025-04-11'),
 ('Flávia Nunes', '2025-04-07')]

In [30]:
# A7: Títulos dos filmes que estão em cartaz

%sql SELECT titulo FROM filmes, sessoes WHERE sessoes.filmes_id=filmes.id GROUP BY titulo

 * sqlite:///TP1.db
Done.

[('A Substância',),
 ('Ainda Estou Aqui',),
 ('Entrevista com o Demônio',),
 ('Hush: A Morte Ouve',),
 ('Longlegs - Vínculo Mortal',),
 ('Noites Brutais',),
 ('Nosferatu',),
 ('Nós',),
 ('O Homem nas Trevas',),
 ('Um Lugar Silencioso: Dia Um',),
 ('Vingadores: Ultimato',)]

In [31]:
# A8: Id das sessões do dia 2025-04-25

%sql SELECT id FROM sessoes WHERE data_hora="2025-04-25"

 * sqlite:///TP1.db
Done.

[(20,), (21,), (22,), (23,), (24,)]

In [32]:
# A9: Id dos clientes e quantos ingressos eles compraram

%sql SELECT cliente_id, COUNT(*) FROM ingressos GROUP BY cliente_id

 * sqlite:///TP1.db
Done.

[(1, 3), (2, 1), (3, 5)]

In [33]:
# A10 Título dos filmes em cartaz pros quais foram comprados ingressos

%sql SELECT * FROM filmes, sessoes, ingressos WHERE sessoes.id=ingressos.sessao_id AND filmes.id=sessoes.filmes_id GROUP BY titulo

 * sqlite:///TP1.db
Done.

[(18, 'Ainda Estou Aqui', 'Drama', 135, 16, 19, 18, 8, '2025-04-24', 52.99, 2, 19, 3, '2025-04-15'),
 (1, 'Noites Brutais', 'Terror', 102, 18, 1, 1, 1, '2025-04-23', 12.99, 5, 1, 1, '2025-04-25'),
 (2, 'Nosferatu', 'Terror', 132, 18, 5, 2, 1, '2025-04-23', 29.99, 3, 5, 3, '2025-04-17'),
 (9, 'Nós', 'Terror', 121, 18, 18, 9, 1, '2025-04-24', 34.99, 1, 18, 3, '2025-04-11')]

In [34]:
# B1: Liste todos os filmes do gênero ’Comédia’

%sql SELECT titulo FROM filmes WHERE genero='Comédia';

 * sqlite:///TP1.db
Done.

[('Gente Grande',), ('Até Que a Sorte nos Separa',), ('Minha Mãe é Uma Peça',)]

In [35]:
# B2: Encontre as salas que possuem capacidade superior a 150 lugares

%sql SELECT nome FROM salas WHERE capacidade>150;

 * sqlite:///TP1.db
Done.

[('08',)]

In [36]:
# B3: Liste as sessões que ocorrem no período noturno (após 18h)

In [37]:
# B4: Mostre os clientes que compraram mais de 2 ingressos

%sql SELECT cliente_id FROM ingressos GROUP BY cliente_id HAVING COUNT(*)>2

 * sqlite:///TP1.db
Done.

[(1,), (3,)]

In [38]:
# B5: Calcule a média de preço dos ingressos vendidos por sessão

%sql SELECT AVG(preco_ingresso) FROM sessoes

 * sqlite:///TP1.db
Done.

[(26.698333333333334,)]

In [39]:
# B6: Liste as sessões que ainda não possuem ingressos vendidos

# %sql SELECT sessoes.id, ingressos.sessao_id FROM (sessoes FULL OUTER JOIN ingressos ON sessoes.id=ingressos.sessao_id) WHERE ingressos.sessao_id IS NULL

%sql SELECT sessoes.id FROM (sessoes FULL OUTER JOIN ingressos ON sessoes.id=ingressos.sessao_id) WHERE ingressos.sessao_id IS NULL

 * sqlite:///TP1.db
Done.

[(3,),
 (4,),
 (6,),
 (7,),
 (8,),
 (9,),
 (10,),
 (11,),
 (12,),
 (13,),
 (14,),
 (15,),
 (16,),
 (17,),
 (20,),
 (21,),
 (22,),
 (23,),
 (24,)]

In [40]:
# B7: Liste os filmes com mais de 3 sessões programadas

%sql SELECT sessoes.filmes_id FROM sessoes GROUP BY sessoes.filmes_id HAVING COUNT(*)>3

 * sqlite:///TP1.db
Done.

[(19,)]

In [12]:
# B8: Encontre os clientes que assistiram a filmes de ’Drama’

# %sql SELECT ingressos.cliente_id FROM ingressos GROUP BY ingressos.cliente_id

%sql SELECT ingressos.cliente_id FROM (ingressos, sessoes, filmes) WHERE ingressos.sessao_id=sessoes.id AND sessoes.filmes_id=filmes.id AND filmes.genero="Drama"

 * sqlite:///TP1.db
Done.

[(3,), (2,)]

In [43]:
# B9: Liste as sessões do filme ’Vingadores: Ultimato’

%sql SELECT sessoes.id FROM (sessoes, filmes) WHERE filmes.titulo="Vingadores: Ultimato" AND filmes.id=sessoes.filmes_id

 * sqlite:///TP1.db
Done.

[(20,), (21,), (22,), (23,), (24,)]

In [44]:
# B10 Qual o dia com maior número de ingressos vendidos?

%sql SELECT MAX(ingressos.max) FROM (SELECT COUNT(*) AS max FROM ingressos GROUP BY data_compra) ingressos

%sql SELECT ingressos.data_compra, COUNT(*) FROM ingressos GROUP BY data_compra

%sql SELECT MAX(ingressos.data_compra), COUNT(*) FROM ingressos GROUP BY data_compra HAVING COUNT(*)=MAX(ingressos.data_compra)

 * sqlite:///TP1.db
Done.
 * sqlite:///TP1.db
Done.
 * sqlite:///TP1.db
Done.

[]